src/Enums/ВидыСертификатов/ВидыСертификатов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСертификатов</name>
  <enumValues>
    <name>ТУ003</name>
  </enumValues>
  <enumValues>
    <name>ТУ004</name>
  </enumValues>
  <enumValues>
    <name>ТУ007</name>
  </enumValues>
  <enumValues>
    <name>ТУ008</name>
  </enumValues>
  <enumValues>
    <name>ТУ499</name>
  </enumValues>
  <enumValues>
    <name>КонтрольныйТУ304</name>
  </enumValues>
  <enumValues>
    <name>КонтрольныйТУ339</name>
  </enumValues>
  <enumValues>
    <name>КонтрольныйТУ310</name>
  </enumValues>
  <enumValues>
    <name>СиловойТУ304</name>
  </enumValues>
  <enumValues>
    <name>СиловойТУ310</name>
  </enumValues>
  <enumValues>
    <name>СиловойТУ337</name>
  </enumValues>
  <enumValues>
    <name>КонтрольныйТУ090</name>
  </enumValues>
  <enumValues>
    <name>АС_839_2019</name>
  </enumValues>
</mdclass:Enum>

src/CommonModules/РаботаСWord/Module.bsl
#Область СлужебныеПроцедурыИФункции		 
// Заполнить значения word.
// 
// Параметры:
//  СтруктураТекДанных  - Структура  -текущие данные строки см. ФормированиеСтруктурыТекущихДанных 
//  ИменаГрупп  - Структура  - содержит имена групп содержащих требуемые значения  сопротивления испытаний 
//  ТребуетсяГост - Булево - не используется надо удалить
//  ДанныеОбъекта - Структура  -Данные объекта для передачи в документ word
//
//  Сокращения в данных объекта: см. реквизиты табличной части СписокКабелей документа ВыпускПродукции (значения испытаний кабеля)
//
// // РезультатК - РезультатИспытанияЖилаКоричневая
// РезультатЧ - РезультатИспытанияЖилаЧерная
// РезультатЗ - РезультатИспытанияЖилаЗаземления
// РезультатС - РезультатИспытанияЖилаСиняя
// РезультатО - РезультатИспытанияЖилаОсновная
// ТЗЖО       - ТребуемоеЗначениеЖилаСиняя
// ТЗЖК       - ТребуемоеЗначениеЖилаКоричневая
// ТЗЖЧерная  - ТребуемоеЗначениеЖилаЧерная
// ТЗЖС       - ТребуемоеЗначениеЖилаСиняя
// ТЗЖЗ       - ТребуемоеЗначениеЖилаЗЩаземления
// РИИЖО      - РезультатИспытанияИзоляцииЖилаОсновная
// РИИЖК      - РезультатИспытанияИзоляцииЖилаКоричневая
// РИИЖЧ      - РезультатИспытанияИзоляцииЖилаЧерная
// РИИЖС      - РезультатИспытанияИзоляцииЖилаСиняя
// РИИЖЗ      - РезультатИспытанияИзоляцииЖилаЗЩаземления
// ТЗИЖО      - ТребуемоеЗначениеИспытанияЖилаОсновная
// ТЗИИЖО      - ТребуемоеЗначениеИспытанияИзоляцииЖилаОсновная
// и т. д. Значение заносимое в данные и есть значение
// // Возвращаемое значение: Структура  - Данные объекта для передачи в документ word с добавленными в функции данными
//  
Функция  ЗаполнитьЗначенияWord(СтруктураТекДанных, ИменаГрупп, ТребуетсяГост, ДанныеОбъекта) Экспорт
		 
	
	ДанныеКабеля =  ИнформацияОКабелеСервер.ИнформацияОКабеле(СтруктураТекДанных);
	
	Если ДанныеКабеля.Свойство("СечениеЖилы") Тогда
		
		ТребуемоеЗначениеИспытанияЖилы = ОбщегоНазначенияСервер.ПолучитьТребуемыеЗначенияИспытания(ДанныеКабеля.СечениеЖилы, ИменаГрупп.ИмяГруппыЖила); 
		
		ИскомыйСимвол = СтрНайти(СтруктураТекДанных.Марка, "в");
		ТребуемоеЗначениеИспытанияИзоляции = ?(НЕ ИскомыйСимвол = 2, 
		ОбщегоНазначенияСервер.ПолучитьТребуемыеЗначенияИспытания(ДанныеКабеля.СечениеЖилы, ИменаГрупп.ИмяГруппыИзоляция),
		150); 
		
		Результат =  ОбщегоНазначенияСервер.ПривестиКФормату(СтруктураТекДанных.РезультатИспытанияЖилаОсновная, ИменаГрупп, ДанныеКабеля);
		
		ДанныеОбъекта.Вставить("РезультатО",	Результат);  
		
		Если  Не СтруктураТекДанных.ПризнакРучныеИзмененияТребуемыхЗначений Тогда
			
			ДанныеОбъекта.Вставить("ТЗЖО",	Формат(ТребуемоеЗначениеИспытанияЖилы, "ЧН=-"));  
			
		Иначе
			ДанныеОбъекта.Вставить("ТЗЖО",	Формат(СтруктураТекДанных.ТребуемоеЗначениеЖилаОсновная, "ЧН=-"));
			
		КонецЕсли;
		
		Результат =  ОбщегоНазначенияСервер.ПривестиКФормату(СтруктураТекДанных.РезультатИспытанияЖилаКоричневая, ИменаГрупп, ДанныеКабеля);
		
		ДанныеОбъекта.Вставить("РезультатК",	Результат);
		
		
		Если  Не СтруктураТекДанных.ПризнакРучныеИзмененияТребуемыхЗначений Тогда
			ДанныеОбъекта.Вставить("ТЗЖК",	Формат(ТребуемоеЗначениеИспытанияЖилы, "ЧН=-"));
		Иначе 
			ДанныеОбъекта.Вставить("ТЗЖК",	Формат(СтруктураТекДанных.ТребуемоеЗначениеЖилаКоричневая, "ЧН=-"));
		КонецЕсли;
		
		
		//Черная
		
		Результат =   ОбщегоНазначенияСервер.ПривестиКФормату(СтруктураТекДанных.РезультатИспытанияЖилаЧерная, ИменаГрупп, ДанныеКабеля);
		
		ДанныеОбъекта.Вставить("РезультатЧ",	Результат);
		
		
		Если  Не СтруктураТекДанных.ПризнакРучныеИзмененияТребуемыхЗначений Тогда	
			ДанныеОбъекта.Вставить("ТЗЖЧ",	Формат(ТребуемоеЗначениеИспытанияЖилы, "ЧН=-"));
		Иначе 
			
			ДанныеОбъекта.Вставить("ТЗЖЧ",	Формат(СтруктураТекДанных.ТребуемоеЗначениеЖилаЧерная, "ЧН=-"));
		КонецЕсли;
		
		
		//Синяя
		Результат =  ОбщегоНазначенияСервер.ПривестиКФормату(СтруктураТекДанных.РезультатИспытанияЖилаСиняя, ИменаГрупп, ДанныеКабеля);
		
		ДанныеОбъекта.Вставить("РезультатС",	Результат);
		
		Если  Не СтруктураТекДанных.ПризнакРучныеИзмененияТребуемыхЗначений Тогда
			ДанныеОбъекта.Вставить("ТЗЖС",	Формат(ТребуемоеЗначениеИспытанияЖилы, "ЧН=-"));
		Иначе 
			ДанныеОбъекта.Вставить("ТЗЖС",	СтруктураТекДанных.ТребуемоеЗначениеЖилаСиняя);
			
		КонецЕсли; 			 
		
		//  жила заземления
		Если СтруктураТекДанных.ВидСертификата = Перечисления.ВидыСертификатов.ТУ499 или    
			СтруктураТекДанных.ВидСертификата = Перечисления.ВидыСертификатов.ТУ003 или 
			СтруктураТекДанных.ВидСертификата = Перечисления.ВидыСертификатов.ТУ007 или
			СтруктураТекДанных.ВидСертификата = Перечисления.ВидыСертификатов.СиловойТУ310 или
			СтруктураТекДанных.ВидСертификата = Перечисления.ВидыСертификатов.СиловойТУ304 или
			СтруктураТекДанных.ВидСертификата = Перечисления.ВидыСертификатов.СиловойТУ310 или
			СтруктураТекДанных.ВидСертификата = Перечисления.ВидыСертификатов.СиловойТУ337  Тогда  
			
			Результат =  ОбщегоНазначенияСервер.ПривестиКФормату(СтруктураТекДанных.РезультатИспытанияЖилаЗаземления, ИменаГрупп, ДанныеКабеля);
			ДанныеОбъекта.Вставить("РезультатЗ",	Результат);
			
			Если  Не СтруктураТекДанных.ПризнакРучныеИзмененияТребуемыхЗначений Тогда
				ДанныеОбъекта.Вставить("ТЗЖЗ", Формат(ТребуемоеЗначениеИспытанияЖилы, "ЧН=-"));
				
			Иначе  
				ДанныеОбъекта.Вставить("ТЗЖЗ", Формат(СтруктураТекДанных.ТребуемоеЗначениеЖилаЗаземления, "ЧН=-"));
			КонецЕсли;
			
		КонецЕсли;    
		
		//Результат изоляция 
		ДанныеОбъекта.Вставить("РИИЖО",	Формат(СтруктураТекДанных.РезультатИспытанияИзоляцииЖилаОсновная, "ЧЦ=15; ЧДЦ=1; ЧН=-")); 
		
		Если  Не СтруктураТекДанных.ПризнакРучныеИзмененияТребуемыхЗначений Тогда	
			ДанныеОбъекта.Вставить("ТЗИЖО", Формат(ТребуемоеЗначениеИспытанияИзоляции, "ЧЦ=15; ЧДЦ=1; ЧН=-"));
			
		Иначе  
			ДанныеОбъекта.Вставить("ТЗИЖО", Формат(СтруктураТекДанных.ТребуемоеЗначениеИзоляцииЖилаОсновная, "ЧЦ=15; ЧДЦ=1; ЧН=-"));
		КонецЕсли;
		ДанныеОбъекта.Вставить("РИИЖК",	Формат(СтруктураТекДанных.РезультатИспытанияИзоляцииЖилаКоричневая, "ЧЦ=15; ЧДЦ=1; ЧН=-"));
		
		Если  Не СтруктураТекДанных.ПризнакРучныеИзмененияТребуемыхЗначений Тогда
			ДанныеОбъекта.Вставить("ТЗИЖК", Формат(ТребуемоеЗначениеИспытанияИзоляции, "ЧЦ=15; ЧДЦ=1; ЧН=-"));
			
		Иначе  
			ДанныеОбъекта.Вставить("ТЗИЖК", Формат(СтруктураТекДанных.ТребуемоеЗначениеИзоляцииЖилаКоричневая, "ЧЦ=15; ЧДЦ=1; ЧН=-"));
			
		КонецЕсли;
		
		ДанныеОбъекта.Вставить("РИИЖЧ",	Формат(СтруктураТекДанных.РезультатИспытанияИзоляцииЖилаЧерная, "ЧЦ=15; ЧДЦ=1; ЧН=-")); 
		Если  Не СтруктураТекДанных.ПризнакРучныеИзмененияТребуемыхЗначений Тогда
			ДанныеОбъекта.Вставить("ТЗИЖЧ", Формат(ТребуемоеЗначениеИспытанияИзоляции, "ЧН=-"));
		Иначе 
			ДанныеОбъекта.Вставить("ТЗИЖЧ", Формат(СтруктураТекДанных.ТребуемоеЗначениеИзоляцииЖилаЧерная, "ЧЦ=15; ЧДЦ=1; ЧН=-"));
		КонецЕсли;
		
		ДанныеОбъекта.Вставить("РИИЖС",	формат(СтруктураТекДанных.РезультатИспытанияИзоляцииЖилаСиняя, "ЧЦ=15; ЧДЦ=1; ЧН=-")); 
		
		Если  Не СтруктураТекДанных.ПризнакРучныеИзмененияТребуемыхЗначений Тогда 
			ДанныеОбъекта.Вставить("ТЗИЖС", формат(ТребуемоеЗначениеИспытанияИзоляции, "ЧН=-"));
			
		Иначе 
			ДанныеОбъекта.Вставить("ТЗИЖС", Формат(СтруктураТекДанных.ТребуемоеЗначениеИзоляцииЖилаСиняя, "ЧЦ=15; ЧДЦ=1; ЧН=-"));
			
		КонецЕсли;
		//Иначе 
		ДанныеОбъекта.Вставить("РИИЖС",	формат(СтруктураТекДанных.РезультатИспытанияИзоляцииЖилаСиняя, "ЧЦ=15; ЧДЦ=1; ЧН=-")); 
		
		Если  Не СтруктураТекДанных.ПризнакРучныеИзмененияТребуемыхЗначений Тогда 
			ДанныеОбъекта.Вставить("ТЗИЖС", ТребуемоеЗначениеИспытанияИзоляции);
			
		Иначе 
			ДанныеОбъекта.Вставить("ТЗИЖС", Формат(СтруктураТекДанных.ТребуемоеЗначениеИзоляцииЖилаСиняя, "ЧЦ=15; ЧДЦ=1; ЧН=-"));
			
		КонецЕсли;
		
		Если СтруктураТекДанных.ВидСертификата = Перечисления.ВидыСертификатов.ТУ499 или    
			СтруктураТекДанных.ВидСертификата = Перечисления.ВидыСертификатов.ТУ003 или 
			СтруктураТекДанных.ВидСертификата = Перечисления.ВидыСертификатов.ТУ007 или
			СтруктураТекДанных.ВидСертификата = Перечисления.ВидыСертификатов.СиловойТУ310 или
			СтруктураТекДанных.ВидСертификата = Перечисления.ВидыСертификатов.СиловойТУ304 или
			СтруктураТекДанных.ВидСертификата = Перечисления.ВидыСертификатов.СиловойТУ310 или
			СтруктураТекДанных.ВидСертификата = Перечисления.ВидыСертификатов.СиловойТУ337  Тогда 
			
			ДанныеОбъекта.Вставить("РИИЖЗ", Формат(СтруктураТекДанных.РезультатИспытанияИзоляцииЖилаЗаземления, "ЧЦ=15; ЧДЦ=1; ЧН=-"));
			
			Если  Не СтруктураТекДанных.ПризнакРучныеИзмененияТребуемыхЗначений Тогда
				ДанныеОбъекта.Вставить("ТЗИЖЗ", Формат(ТребуемоеЗначениеИспытанияИзоляции, "ЧЦ=15; ЧДЦ=1; ЧН=-"));
			Иначе  
				ДанныеОбъекта.Вставить("ТЗИЖЗ", Формат(СтруктураТекДанных.ТребуемоеЗначениеИзоляцииЖилаЗаземления, "ЧЦ=15; ЧДЦ=1; ЧН=-"));
				
			КонецЕсли; 
			
		КонецЕсли;	
		
	КонецЕсли;
	
	Возврат ДанныеОбъекта;
	
КонецФункции  
#КонецОбласти
